Revit 2024 API
BuiltInFailures.GeneralFailures.ErrorInFamilyResolved Property
 An error occurred in family "[Name]" and was automatically resolved. Please review changes made to the family.\nError Information:\n"[Text]"\nError Resolution: [Resolution]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ErrorInFamilyResolved { get; }
Visual Basic
Public Shared ReadOnly Property ErrorInFamilyResolved As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ErrorInFamilyResolved {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace